{"modelTopology": {"training_config": {"metrics": ["accuracy"], "optimizer_config": {"config": {"epsilon": 1e-08, "amsgrad": false, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 9.999999974752427e-07, "lr": 9.999999747378752e-05}, "class_name": "Adam"}, "loss": "categorical_crossentropy", "sample_weight_mode": null, "loss_weights": null}, "model_config": {"config": {"name": "sequential_1", "layers": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "dtype": "float32", "batch_input_shape": [null, 4], "units": 30, "activation": "relu", "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "dtype": "float32", "batch_input_shape": [null, 4], "units": 20, "activation": "relu", "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "dtype": "float32", "batch_input_shape": [null, 4], "units": 15, "activation": "relu", "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 6, "kernel_constraint": null, "name": "dense_4", "trainable": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "keras_version": "2.2.4", "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_1/kernel", "shape": [4, 30], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [30], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [30, 20], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [20], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [20, 15], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [15], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [15, 6], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [6], "dtype": "float32"}]}]}