{"modelTopology": {"model_config": {"config": {"layers": [{"config": {"activity_regularizer": null, "bias_constraint": null, "units": 30, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "kernel_constraint": null, "batch_input_shape": [null, 4], "name": "dense_1", "activation": "relu", "dtype": "float32"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "rate": 0.1, "trainable": true, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "units": 20, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "kernel_constraint": null, "batch_input_shape": [null, 4], "name": "dense_2", "activation": "relu", "dtype": "float32"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "rate": 0.1, "trainable": true, "seed": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "units": 15, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "kernel_constraint": null, "batch_input_shape": [null, 4], "name": "dense_3", "activation": "relu", "dtype": "float32"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "rate": 0.1, "trainable": true, "seed": null, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "units": 6, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_4", "activation": "softmax"}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}, "backend": "tensorflow", "keras_version": "2.2.4", "training_config": {"sample_weight_mode": null, "loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"config": {"lr": 9.999999747378752e-05, "decay": 9.999999974752427e-07, "epsilon": 1e-08, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "amsgrad": false}, "class_name": "Adam"}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [4, 30], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [30], "name": "dense_1/bias", "dtype": "float32"}, {"shape": [30, 20], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [20], "name": "dense_2/bias", "dtype": "float32"}, {"shape": [20, 15], "name": "dense_3/kernel", "dtype": "float32"}, {"shape": [15], "name": "dense_3/bias", "dtype": "float32"}, {"shape": [15, 6], "name": "dense_4/kernel", "dtype": "float32"}, {"shape": [6], "name": "dense_4/bias", "dtype": "float32"}]}]}