{"modelTopology": {"backend": "tensorflow", "training_config": {"metrics": ["accuracy"], "sample_weight_mode": null, "optimizer_config": {"config": {"amsgrad": false, "decay": 9.999999747378752e-06, "lr": 9.999999747378752e-05, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421}, "class_name": "Adam"}, "loss": "categorical_crossentropy", "loss_weights": null}, "model_config": {"config": {"name": "sequential_1", "layers": [{"config": {"units": 21, "dtype": "float32", "use_bias": true, "activation": "relu", "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 4], "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"units": 16, "dtype": "float32", "use_bias": true, "activation": "relu", "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "name": "dense_2", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 4], "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"units": 11, "dtype": "float32", "use_bias": true, "activation": "relu", "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-05}, "class_name": "L1L2"}, "name": "dense_3", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 4], "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_3", "seed": null, "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"units": 6, "use_bias": true, "activation": "softmax", "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_4", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "keras_version": "2.2.4"}, "weightsManifest": [{"weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [4, 21]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [21]}, {"name": "dense_2/kernel", "dtype": "float32", "shape": [21, 16]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [16]}, {"name": "dense_3/kernel", "dtype": "float32", "shape": [16, 11]}, {"name": "dense_3/bias", "dtype": "float32", "shape": [11]}, {"name": "dense_4/kernel", "dtype": "float32", "shape": [11, 6]}, {"name": "dense_4/bias", "dtype": "float32", "shape": [6]}], "paths": ["group1-shard1of1"]}]}